# NoHostForToposolidSubregion Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SubRegionFailures..::..NoHostForToposolidSubregion Property
BuiltInFailures..::..SubRegionFailures Class See Also
---
This sub-division now does not appear to overlap any Toposolid with an appropriate Phase and Design Option.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoHostForToposolidSubregion { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoHostForToposolidSubregion As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoHostForToposolidSubregion {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SubRegionFailures Class
Autodesk.Revit.DB Namespace